# Уведомления пользователям
TORRENT_BLOCKED_MSG = (
    "⚠️ <b>Замечено использование торрентов</b> ⚠️\n\n"
    "<b>Уважаемый пользователь, мы обнаружили использование торрент-трафика в вашей подписке.</b>\n\n"
    "📋 <b>Детали:</b>"
    "<blockquote>"
    "• Подписка: <code>{username}</code>\n"
    "• Сервер: {country}\n"
    "• Время блокировки страны: <b>{duration} минут</b>"
    "</blockquote>\n\n"
    "❗️ <b>Важно:</b>\n"
    "• Возможно, вы забыли отключить торрент-клиент и сейчас качаете или раздаете торренты через VPN\n"
    "• Загрузка и раздача через торренты запрещена согласно правилам использования сервиса\n"
    "• Пожалуйста, полностью выключите торрент-клиент\n\n"
    "⏳ <b>После истечения времени блокировки доступ будет автоматически восстановлен.</b>\n\n"
    "⚠️ <b>Внимание:</b> При повторном использовании торрентов, блокировка будет применена снова."
)

TORRENT_UNBLOCKED_MSG = (
    "✅ <b>Доступ восстановлен</b>\n\n"
    "<b>Уважаемый пользователь, временные ограничения для вашей подписки сняты.</b>\n\n"
    "📋 <b>Детали:</b>"
    "<blockquote>"
    "• Подписка: <code>{username}</code>\n"
    "• Сервер: {country}"
    "</blockquote>\n\n"
    "💬 <b>Напоминание:</b>\n"
    "• Пожалуйста, воздержитесь от использования торрентов\n"
    "• Убедитесь, что торрент-клиент полностью выключен"
)

# Уведомления администраторам
ADMIN_TORRENT_BLOCKED_TEMPLATE = (
    "🚫 <b>Блокировка торрентов</b>\n\n"
    "📋 <b>Детали:</b>\n"
    "<blockquote>"
    "• Пользователь: <code>{username}</code>\n"
    "{tg_id_info}{username_info}{name_info}• IP: <code>{ip}</code>\n"
    "• Сервер: {server}\n"
    "• Страна: {country}\n"
    "• Длительность блокировки: <b>{duration} минут</b>\n"
    "• Время: {timestamp}\n"
    "</blockquote>"
)

ADMIN_TORRENT_UNBLOCKED_TEMPLATE = (
    "✅ <b>Разблокировка торрентов</b>\n\n"
    "📋 <b>Детали:</b>\n"
    "<blockquote>"
    "• Пользователь: <code>{username}</code>\n"
    "{tg_id_info}{username_info}{name_info}• IP: <code>{ip}</code>\n"
    "• Сервер: {server}\n"
    "• Страна: {country}\n"
    "• Время: {timestamp}\n"
    "</blockquote>"
)
